import React, { Component } from 'react';
import { Container, Col, Row, Card, ListGroup } from 'react-bootstrap';
import forma1 from '../assets/blogpost/15.png';
import forma2 from '../assets/blogpost/17.png';
import forma3 from '../assets/blogpost/20.png';
import forma4 from '../assets/blogpost/25.png';
import forma5 from '../assets/blogpost/6.png';
import forma6 from '../assets/blogpost/16.png';
import forma7 from '../assets/blogpost/14.png';
import forma8 from '../assets/blogpost/1.png';
import forma9 from '../assets/blogpost/3.png';
import forma10 from '../assets/blogpost/4.png';
import forma11 from '../assets/blogpost/19.png';

export default class Blog extends Component {
  render() {
    return (
      <Container>
        <Row>
          <Col md="9">
          <Card className="m-5" border="succes">
              <img mt-2
                width={869}
                height={869}
                className="mr-3"
                src={ forma1 }

              />
              <Card.Body>
                <h5>Blog post 1</h5>
                <p>
                <p>Разработка оформления под ключ 💙</p>Перманентный макияж, или татуаж, - это процедура, при помощи которой краска вводится в верхний слой дермы для создания эффекта макияжа. Этот вид макияжа позволяет подчеркнуть естественную красоту лица, делая его выразительным и привлекательным. Перманентный макияж может быть использован для коррекции формы бровей, глаз и губ, а также для создания идеального контура. Эта процедура позволяет сохранить свежий и ухоженный вид лица на протяжении длительного времени, освобождая от необходимости ежедневно наносить макияж. Важно помнить, что для достижения наилучшего результата следует обратиться к профессионалу, имеющему опыт и квалификацию в области перманентного макияжа.</p>
              </Card.Body>
            </Card>

            <Card className="m-5" border="succes">
              <img mt-2
                width={869}
                height={869}
                className="mr-3"
                src={ forma11 }

              />
              <Card.Body>
                <h5>Blog post 2</h5>
                <p>
                <p>Разработка оформления под ключ 🥾</p>
                <h5>Почему стоит выбрать магазин брендовой одежды?</h5>
                В мире моды существует огромное количество магазинов, где можно приобрести одежду. Однако магазины брендовой одежды занимают особое место среди покупателей. Чем же они так привлекательны и почему стоит выбрать именно их для покупок?</p>
                <h5>Качество и стиль</h5><p>Одним из ключевых преимуществ магазинов брендовой одежды является высокое качество товаров. Известные бренды уделяют особое внимание выбору материалов, пошиву и деталям, что делает их продукцию долговечной и приятной на ощупь. Кроме того, бренды часто следят за последними модными тенденциями, предлагая стильные и актуальные вещи.</p>
                <h5>Уникальность и эксклюзивность</h5><p>Покупая одежду в магазине брендов, вы можете быть уверены, что ваш наряд будет уникальным. Брендовая одежда часто выпускается в ограниченных коллекциях, что делает ее более эксклюзивной. Вы не встретите такие же наряды на каждом углу, что добавляет индивидуальности вашему образу.</p>
                <h5>Статус и престиж</h5><p>Носить вещи известных брендов - это не только красиво, но и престижно. Одежда от известного дизайнера или бренда может стать своеобразным символом статуса. Это позволяет выделиться из толпы, подчеркнуть свой вкус и утонченность.</p>
                <h5>Инвестиция в гардероб</h5><p>Покупка брендовой одежды часто рассматривается как инвестиция в гардероб. Качественные вещи от известных брендов служат долго, не теряя своего внешнего вида. Более того, некоторые предметы могут со временем стать коллекционными, увеличивая свою стоимость.</p>
              </Card.Body>
            </Card>

            <Card className="m-5" border="succes">
              <img mt-2
                width={869}
                height={869}
                className="mr-3"
                src={ forma2 }

              />
              <Card.Body>
                <h5>Blog post 3</h5>
                <p>
                <p>Разработка оформления под ключ 🌸</p>

                  <p>Весна - это прекрасное время года, наполненное обновлениями и новыми начинаниями. С приходом первого дня весны ощущается особенная энергетика и легкость, которые наполняют сердца и разумы каждого.</p>

                  <p>В наше современное время мы охвачены огромным количеством сообщений и информации, которые постоянно приходят к нам из разных источников. Именно поэтому редко можно увидеть объемные тексты, полные познавательной информации, в наших обычных постах. Но сегодня - исключение.</p>

                  <p>Друзья, я хочу поделиться с вами весенним вайбом и передать вам свою радость и вдохновение. Ведь именно весна пробуждает в нас новые идеи, наполняет наши мысли свежим воздухом и возрождает наши души. Это время, когда природа преображается перед нашими глазами, даруя нам прекрасные пейзажи и яркие краски!</p>
                </p>
              </Card.Body>
            </Card>

            <Card className="m-5" border="succes">
              <img mt-2
                width={869}
                height={869}
                className="mr-3"
                src={ forma3 }

              />
              <Card.Body>
                <h5>Blog post 4</h5>
                <p>
                <p>Разработка оформления под ключ 🔨</p>Ремонт квартиры - это ответственное и трудоемкое занятие, которое требует не только материальных затрат, но и временных ресурсов. Однако правильно спланированный и качественно выполненный ремонт способен преобразить обычное жилище в уютное и стильное пространство, отражающее вкус и индивидуальность хозяев.</p>

                  <p>Приступая к ремонту квартиры, важно определить цели и пожелания заказчика, тщательно просчитать бюджет и выбрать квалифицированных специалистов. Ремонтные работы могут включать в себя демонтажные работы, выравнивание стен и потолков, электромонтажные работы, монтаж сантехнического оборудования, отделочные работы и другие этапы.</p>
              </Card.Body>
            </Card>

            <Card className="m-5" border="succes">
              <img mt-2
                width={869}
                height={869}
                className="mr-3"
                src={ forma4 }

              />
              <Card.Body>
                <h5>Blog post 5</h5>
                <p>
                <p>Разработка оформления под ключ 🍕</p>Ресторан "Вкус Италии" - сеть заведений, где каждый посетитель может насладиться изысканными блюдами итальянской и японской кухни. Уютная атмосфера, внимательный персонал и широкий выбор пицц и роллов делают это место идеальным для проведения вечеров в компании друзей или семьи. Каждое блюдо приготовлено из свежих ингредиентов по оригинальным рецептам, что делает их по-настоящему вкусными и аппетитными. Независимо от того, предпочитаете ли вы классическую пепперони пиццу или экзотические роллы с угрем и авокадо, в ресторане "Pizza & Rolls" вы обязательно найдете что-то по своему вкусу. Приходите к нам и погрузитесь в мир изысканного гастрономического опыта!</p>
              </Card.Body>
            </Card>

            <Card className="m-5" border="succes">
              <img mt-2
                width={869}
                height={869}
                className="mr-3"
                src={ forma5 }

              />
              <Card.Body>
                <h5>Blog post 6</h5>
                <p>
                <p>Разработка оформления под ключ 🍕</p>Ресторан "Накорми настроение" - сеть заведений, где каждый посетитель может насладиться изысканными блюдами итальянской и японской кухни. Уютная атмосфера, внимательный персонал и широкий выбор пицц и роллов делают это место идеальным для проведения вечеров в компании друзей или семьи. Каждое блюдо приготовлено из свежих ингредиентов по оригинальным рецептам, что делает их по-настоящему вкусными и аппетитными. Независимо от того, предпочитаете ли вы классическую пепперони пиццу или экзотические роллы с угрем и авокадо, в ресторане "Pizza & Rolls" вы обязательно найдете что-то по своему вкусу. Приходите к нам и погрузитесь в мир изысканного гастрономического опыта!</p>
              </Card.Body>
            </Card>

            <Card className="m-5" border="succes">
              <img mt-2
                width={869}
                height={869}
                className="mr-3"
                src={ forma6 }

              />
              <Card.Body>
                <h5>Blog post 7</h5>
                <p>
                <p>Разработка оформления под ключ 𓆩🖤𓆪</p>Тату-салон — это место, где каждый человек может воплотить свои самые смелые идеи в виде уникального татуировочного рисунка. Здесь работают настоящие мастера своего дела, которые способны создать произведение искусства прямо на коже. Тату-салон предлагает широкий выбор услуг: от классических черно-белых татуировок до ярких цветных композиций. Каждый клиент может рассчитывать на индивидуальный подход и качественное исполнение работы. Главное преимущество тату-салона — это возможность получить уникальный и неповторимый рисунок, который будет гармонировать с индивидуальностью своего обладателя.</p>
              </Card.Body>
            </Card>

            <Card className="m-5" border="succes">
              <img mt-2
                width={869}
                height={869}
                className="mr-3"
                src={ forma7 }

              />
              <Card.Body>
                <h5>Blog post 8</h5>
                <p>
                <p>Разработка оформления под ключ 👾</p>Тату-салон - это место, где каждая линия, каждая точка, каждая тень имеет свой смысл и значение. Это не просто место для нанесения красивых узоров на кожу, это настоящее искусство, где каждый мастер стремится создать шедевр на теле своего клиента.</p>

                  <p>Здесь работают настоящие профессионалы, которые в совершенстве владеют не только техникой татуировки, но и понимают психологию клиентов. Ведь иногда за татуировкой стоит целая история, эмоции, чувства, которые нужно уважать и учитывать при создании произведения искусства.</p>

                  <p>Тату-салон - это не просто место для красивой украшательства, это место, где рождаются идеи, мечты, воплощаются самые смелые фантазии. Каждая работы, каждая линия, каждый контур - это не просто картинка на коже, это часть человека, его история, его самовыражение.</p>

                  <p>Именно поэтому тату-салон привлекает к себе тех, кто ценит искусство, кто хочет выделиться, выразить себя и свою индивидуальность. Специалисты этого заведения готовы воплотить любые ваши задумки в реалии, подчеркнуть вашу уникальность и помочь вам стать еще ближе к себе.</p>
              </Card.Body>
            </Card>

            <Card className="m-5" border="succes">
              <img mt-2
                width={869}
                height={869}
                className="mr-3"
                src={ forma8 }

              />
              <Card.Body>
                <h5>Blog post 9</h5>
                <p>
                <p>Разработка оформления под ключ 🍕</p>Ресторан "Астория" - сеть заведений, где каждый посетитель может насладиться изысканными блюдами итальянской и японской кухни. Уютная атмосфера, внимательный персонал и широкий выбор пицц и роллов делают это место идеальным для проведения вечеров в компании друзей или семьи. Каждое блюдо приготовлено из свежих ингредиентов по оригинальным рецептам, что делает их по-настоящему вкусными и аппетитными. Независимо от того, предпочитаете ли вы классическую пепперони пиццу или экзотические роллы с угрем и авокадо, в ресторане "Pizza & Rolls" вы обязательно найдете что-то по своему вкусу. Приходите к нам и погрузитесь в мир изысканного гастрономического опыта!</p>
              </Card.Body>
            </Card>

            <Card className="m-5" border="succes">
              <img mt-2
                width={869}
                height={869}
                className="mr-3"
                src={ forma9 }

              />
              <Card.Body>
                <h5>Blog post 10</h5>
                <p>
                <p>Разработка оформления под ключ 💡</p>Twitch стримеры - это люди, которые делают прямые трансляции своей игры или контента на платформе Twitch. Они обладают уникальным талантом привлекать зрителей и создавать увлекательный контент для своей аудитории. Стримеры часто взаимодействуют с зрителями через чат, отвечая на их вопросы или просто поддерживая беседу.</p>
                  <p>Многие стримеры создают собственные каналы на Twitch, где регулярно выкладывают новые видео или стримы. Они могут играть в популярные игры, обсуждать актуальные события или просто делиться своими мыслями и впечатлениями. Стримеры могут иметь огромное количество подписчиков, что делает их влиятельными фигурами в мире онлайн-контента.</p>
                  <p>Одной из главных особенностей Twitch стримеров является их способность создавать сообщество вокруг своего контента. Зрители могут общаться между собой, обмениваться мнениями и даже поддерживать своего любимого стримера финансово через донаты и подписки. Это создает уникальную атмосферу взаимодействия и взаимопонимания между стримером и его зрителями.</p>
                  <p>В целом, Twitch стримеры играют важную роль в мире онлайн-развлечений, предоставляя зрителям возможность насладиться игровым контентом или просто провести время с увлекательным и интересным человеком. Их влияние и популярность продолжают расти, делая их неотъемлемой частью современной интернет-культуры.</p>
              </Card.Body>
            </Card>

            <Card className="m-5" border="succes">
              <img mt-2
                width={869}
                height={869}
                className="mr-3"
                src={ forma10 }

              />
              <Card.Body>
                <h5>Blog post 11</h5>
                <p>
                <p>Разработка оформления под ключ 👟</p>Академия кроссовок - это место, где каждый любитель спорта или просто комфортной обуви может найти идеальную пару для себя. Здесь представлен огромный ассортимент разнообразных моделей от ведущих мировых брендов. Кроссовки для бега, тренировок, повседневной носки или модели для особых случаев - выбор здесь поистине впечатляющий. Кроме того, в магазине кроссовок можно получить профессиональную консультацию по подбору обуви и аксессуаров, а также узнать о последних тенденциях в мире спортивной моды. В итоге, каждый клиент может быть уверен, что приобретает не только качественный товар, но и отличный сервис, который делает покупку в магазине кроссовок по-настоящему приятным и удобным процессом.</p>
              </Card.Body>
            </Card>
          </Col>

          <Col md="3">
            <h5 className="text-center mt-5">Categories</h5>
            <Card>
              <ListGroup variant="flush">
                <ListGroup.Item>Blue</ListGroup.Item>
                <ListGroup.Item>Pink</ListGroup.Item>
                <ListGroup.Item>Black</ListGroup.Item>
                <ListGroup.Item>Orange</ListGroup.Item>
                <ListGroup.Item>Transparent</ListGroup.Item>
                <ListGroup.Item>Green</ListGroup.Item>
              </ListGroup>
            </Card>

            <Card className="mt-3" bg="primary">
              <Card.Body>
                <Card.Title>Side widget</Card.Title>
                <Card.Text>
                  Выбирай для себя лучшую категорию =)
                </Card.Text>
              </Card.Body>
            </Card>
          </Col>
        </Row>
      </Container>
    );
  }
}
