import './App.css';

function TextBlock() {
    return (
        <div id="textblock">
            <div id="textblock-container">
                <h1 id="textblock-title">Что такое графический дизайн?</h1>
                <p id="textblock-content">
                Графический дизайн - это процесс визуальной коммуникации и решения проблем с использованием изображений, типографики и других визуальных элементов. Цель графического дизайна - передать идеи и информацию эффективно и привлекательно.
                <br/><br/>
                <h1 id="textblock-title">Почему графический дизайн востребован сейчас:</h1>
                В современном мире графический дизайн стал более востребованным, чем когда-либо, благодаря росту цифровых технологий и увеличению потребности в визуальном контенте. Вот основные причины:<br/><br/>
                Цифровизация: <p>Быстрый рост цифровых устройств, таких как смартфоны, планшеты и компьютеры, создал огромный спрос на графический дизайн для веб-сайтов, приложений, социальных сетей и других цифровых платформ.</p>
                Визуальный контент: <p>Люди лучше воспринимают и запоминают визуальную информацию, чем текстовую. Поэтому предприятия и организации используют графический дизайн, чтобы выделяться и привлекать свою аудиторию.</p>
                Социальные сети: <p>Социальные сети стали мощной платформой для бизнеса и маркетинга. Графический дизайн играет важную роль в создании привлекательного контента, который будет распространяться в социальных сетях.</p>
                Глобализация: <p>По мере того как предприятия расширяются на новые рынки, возникла необходимость в культурно чувствительном и эффективном графическом дизайне, который будет резонировать с международной аудиторией.</p>
                Повышение конкуренции: <p>В условиях высокой конкуренции на рынке предприятия используют графический дизайн, чтобы выделиться, сформировать свой бренд и привлечь клиентов.</p>
                <h1 id="textblock-title">Востребованные области в графическом дизайне:</h1>
                * Веб-дизайн;<br></br>
                * Дизайн приложений;<br></br>
                * Дизайн логотипов и фирменного стиля;<br></br>
                * Социальный дизайн и маркетинг;<br></br>
                * Дизайн упаковки.
                </p>
            </div>
            <footer id='textblock-footer'>Designer 🧡 By&nbsp;<a id="textblock-devsense" href="https://vk.com/evrydzn">Evry Project</a></footer>
        </div>
    );
}

export default TextBlock;